In [1]:
import requests
from dotenv import load_dotenv
import os 
import csv
from pathlib import Path
import json
import pandas as pd

In [39]:
# Use Pandas to read the following CSV files into DataFrames. Be sure to convert the dates to a DateTimeIndex.
# whale_returns.csv: Contains returns of some famous "whale" investors' portfolios.
csvpath = Path('./Starter_Code/Resources/whale_returns.csv')
Whale_data = pd.read_csv(csvpath, index_col='Date')
Whale_data.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-02,NaN,NaN,NaN,NaN
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [ ]:
type(Whale_data)

In [41]:
# algo_returns.csv: Contains returns from the in-house trading algorithms from your company.
csvpath = Path('./Starter_Code/Resources/algo_returns.csv')
Algo_data = pd.read_csv(csvpath,index_col='Date')
Algo_data.head()

              Algo 1  Algo 2
Date
2014-05-28  0.001745     NaN
2014-05-29  0.003978     NaN
2014-05-30  0.004464     NaN
2014-06-02  0.005692     NaN
2014-06-03  0.005292     NaN

In [42]:
type(Algo_data)

pandas.core.frame.DataFrame

In [43]:
# sp500_history.csv: Contains historical closing prices of the S&P 500 Index.
csvpath = Path('./Starter_Code/Resources/sp500_history.csv')
sp500_data = pd.read_csv(csvpath,index_col='Date')
sp500_data.head()

              Close
Date
23-Apr-19  $2933.68
22-Apr-19  $2907.97
18-Apr-19  $2905.03
17-Apr-19  $2900.45
16-Apr-19  $2907.06

### 2. Identify and remove null values.

In [44]:
Whale_data.dropna()
Whale_data.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-02,NaN,NaN,NaN,NaN
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [45]:
Algo_data.dropna()

              Algo 1    Algo 2
Date
2014-06-05  0.004062  0.013285
2014-06-06  0.001857  0.008284
2014-06-09 -0.005012  0.005668
2014-06-10  0.004406 -0.000735
2014-06-11  0.004760 -0.003761
...              ...       ...
2019-04-25  0.000682 -0.007247
2019-04-26  0.002981  0.005256
2019-04-29  0.005208  0.002829
2019-04-30 -0.002944 -0.001570
2019-05-01  0.000094 -0.007358

[1235 rows x 2 columns]

In [46]:
Algo_data.tail()

              Algo 1    Algo 2
Date
2019-04-25  0.000682 -0.007247
2019-04-26  0.002981  0.005256
2019-04-29  0.005208  0.002829
2019-04-30 -0.002944 -0.001570
2019-05-01  0.000094 -0.007358

In [47]:
sp500_data.dropna()

              Close
Date
23-Apr-19  $2933.68
22-Apr-19  $2907.97
18-Apr-19  $2905.03
17-Apr-19  $2900.45
16-Apr-19  $2907.06
...             ...
5-Oct-12   $1460.93
4-Oct-12   $1461.40
3-Oct-12   $1450.99
2-Oct-12   $1445.75
1-Oct-12   $1444.49

[1649 rows x 1 columns]

In [48]:
sp500_data.head()

              Close
Date
23-Apr-19  $2933.68
22-Apr-19  $2907.97
18-Apr-19  $2905.03
17-Apr-19  $2900.45
16-Apr-19  $2907.06

### 3.Remove any non-numeric values (e.g., dollar signs) from the DataFrames and convert the data types as needed.

In [49]:
#DONT WORK--------------------------------------------------
#sp500_data.columns = sp500_data.columns.str.replace('[#@$&]', '')
#Whale_data['ClosingPrice']= Whale_data['Close'].str.replace('[#@$&]','')
#----------------------------------------------------------

# Runs but doesnt remove $-------------------------------------
# sp500_data.columns = sp500_data.columns.str.replace('$','', regex=True)
#--------------------------------------------------------------


sp500_data["Close"] = sp500_data["Close"].str.replace("$","").astype(float)
sp500_data.head()
#UNSURE why this throws error but it works so eh ok for now.

C:\Users\danie\anaconda3\envs\dev\lib\site-packages\ipykernel_launcher.py:11: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  # This is added back by InteractiveShellApp.init_path()

             Close
Date
23-Apr-19  2933.68
22-Apr-19  2907.97
18-Apr-19  2905.03
17-Apr-19  2900.45
16-Apr-19  2907.06

### 4.The whale portfolios and algorithmic portfolio CSV files contain daily returns, but the S&P 500 CSV file contains closing prices.
### Convert the S&P 500 closing prices to daily returns.

In [50]:
sp500_data.pct_change()

              Close
Date
23-Apr-19       NaN
22-Apr-19 -0.008764
18-Apr-19 -0.001011
17-Apr-19 -0.001577
16-Apr-19  0.002279
...             ...
5-Oct-12   0.003469
4-Oct-12   0.000322
3-Oct-12  -0.007123
2-Oct-12  -0.003611
1-Oct-12  -0.000872

[1649 rows x 1 columns]

In [55]:
sp500_data.rename(columns = {'Close':'S&P500'}, inplace = True)
sp500_data.head()

            S&P500
Date
23-Apr-19  2933.68
22-Apr-19  2907.97
18-Apr-19  2905.03
17-Apr-19  2900.45
16-Apr-19  2907.06

### 5. Join Whale Returns, Algorithmic Returns, and the S&P 500 Returns into a single DataFrame with columns for each portfolio's returns.

In [66]:
Merge_Portfolio = pd.concat([sp500_data, Algo_data, Whale_data], axis="columns", join="outer")
Merge_Portfolio.head()

,S&P500,Algo 1,Algo 2,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,,,,
23-Apr-19,2933.68,NaN,NaN,NaN,NaN,NaN,NaN
22-Apr-19,2907.97,NaN,NaN,NaN,NaN,NaN,NaN
18-Apr-19,2905.03,NaN,NaN,NaN,NaN,NaN,NaN
17-Apr-19,2900.45,NaN,NaN,NaN,NaN,NaN,NaN
16-Apr-19,2907.06,NaN,NaN,NaN,NaN,NaN,NaN

In [59]:
Merge_Portfolio.tail()

,S&P500,Algo 1,Algo 2,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,,,,
2016-07-04,NaN,NaN,NaN,0.0,0.0,0.0,0.0
2016-09-05,NaN,NaN,NaN,0.0,0.0,0.0,0.0
2016-11-24,NaN,NaN,NaN,0.0,0.0,0.0,0.0
2017-01-16,NaN,NaN,NaN,0.0,0.0,0.0,0.0
2017-02-20,NaN,NaN,NaN,0.0,0.0,0.0,0.0

# Perform Quantitative Analysis

In [62]:
### Analyze the data to determine if any of the portfolios outperform the stock market (that is, the S&P 500). 
### Specifically, you will do a performance analysis and a risk analysis, and then calculate rolling statistics and Sharpe ratios.

In [63]:
# 1.Calculate and plot daily returns of all portfolios.
Merge_Portfolio.pct_change()

,S&P500,Algo 1,Algo 2,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,,,,
23-Apr-19,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22-Apr-19,-0.008764,NaN,NaN,NaN,NaN,NaN,NaN
18-Apr-19,-0.001011,NaN,NaN,NaN,NaN,NaN,NaN
17-Apr-19,-0.001577,NaN,NaN,NaN,NaN,NaN,NaN
16-Apr-19,0.002279,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
2016-07-04,0.000000,0.0,0.0,NaN,NaN,NaN,NaN
2016-09-05,0.000000,0.0,0.0,NaN,NaN,NaN,NaN
2016-11-24,0.000000,0.0,0.0,NaN,NaN,NaN,NaN
2017-01-16,0.000000,0.0,0.0,NaN,NaN,NaN,NaN
2017-02-20,0.000000,0.0,0.0,NaN,NaN,NaN,NaN

In [ ]:
# 2.Calculate and plot cumulative returns for all portfolios. Does any portfolio outperform the S&P 500?

###

### Risk Analysis

In [ ]:
# 1.Create a box plot for each of the returns.

In [ ]:
# 2.Calculate the standard deviation for each portfolio.

In [ ]:
# 3.Determine which portfolios are riskier than the S&P 500.

In [ ]:
# 4.Calculate the annualized standard deviation.